app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "chemistry"], ["room_number", 404], ["created_at", "2020-11-28 15:39:15.821888"], ["updated_at", "2020-11-28 15:39:15.821888"]]
---
    def create
        #byebug
        @school = SchoolClass.new
        @school.title = params[:school_class_title]
        @school.room_number = params[:school_class_room_number]
        @school.save

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        @school = SchoolClass.find_by_id(params[:id])

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def edit
        @school = SchoolClass.find_by_id(params[:id])

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "school_classes" SET "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["room_number", 4040], ["updated_at", "2020-11-28 15:42:45.876176"], ["id", 1]]
---
    def update
        #byebug
        @school = SchoolClass.find_by_id(params[:id])
        @school.update(room_number: params[:school_class][:room_number])