app/controllers/students_controller.rb

    def create
        #byebug
        @student = Student.new
        @student.first_name = params[:student_first_name]
        @student.last_name = params[:student_last_name]
        @student.save
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Michael"], ["last_name", "Iodice"], ["created_at", "2020-11-28 00:36:38.185375"], ["updated_at", "2020-11-28 00:36:38.185375"]]

    def update
        #byebug
        @student = Student.find_by_id(params[:id])
        @student.update(first_name: params[:student][:first_name])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Michael B-"], ["updated_at", "2020-11-28 15:11:47.106078"], ["id", 10]]